
# Data Manipulation with Python Pandas

#### Introduction to Pandas

__Why Pandas?__

NumPy is great for mathematical computing, but why do we need Pandas?.
well, Numpy is still a low-level tool when it comes to data munging(processing or filtering of raw data into another form). This is where Pandas is useful.

__Pandas with several functionalities__
* Intrinsic data alignment
* Data operation functions (merge, groupby, join)
* Data handling functions
* Data standardization functions
* Data Structures handle major use cases

#### Pandas Features
The various features of Pandas make it an efficient library for Data Scientists.
* Powerful data structure
* Fast and efficient data wrangling
* Easy data aggregation and transformation
* Tools for reading and writing data
* Intelligent and automated data alignment
* High performance merging and joining of data sets

#### Data Structures
The four main libraries of Pandas data structure are:
##### Series
    * One-dimensional labeled array
    * Supports multiple data types
    
    
##### Data Frame
    * Two-dimensional labeled array
    * Supports multiple data types
    * Input can be a series
    * Input can be another DataFrame
    
    
##### Panel
    * Three-dimensional labeled array
    * Supports multiple data types
    * Items, axis 0
    * Major axis, rows
    * Minor axis, columns
    
    
##### Panel 4D (Experimental)
    * Four-dimensional labeled array
    * Supports multiple data types
    * Labels, axis 0
    * Items, axis 1
    * Major axis, rows
    * Minor axis, columns

#### Understanding Series
Series is a one-dimensional array-like object containing data and labels (or index).
Data alignment is intrinsic and will not be broken until changed explicitly by program.

#### Series
Series can be created with different data inputs:

__Data Types__

Data types of Data Inputs can be:
* Integer
* String
* Python Object
* Floating Point

__Data Input__
* ndarray
* dict
* scalar
* list

__Series__
* using Data Inputs an 1D-array-like object containing data and labels (or index), which is called as series

##### How to Create Series?

Key points to note while creating a series are:
* Import Pandas as it is the main library (Import pandas as pd)
* Import NumPy while working with ndarrays (Import numpy as np)
* Apply the syntax and pass the data elements as arguments

__Basic Method__

S = pd.Series(data, index = [index])

__Series__

    index datavalue

    0     4

    1     11
    
    2     21

    3     36

##### Creating Series from a List

In [1]:
#Import libraries
import numpy as np
import pandas as pd 

#Pass list as an argument
first_series = pd.Series(list('abcdef'))
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

We have not created index for data but notice that data alignment is done automatically.

##### Creating Series from an ndarray

In [2]:
#ndarray for countries
np_country = np.array(['Luxembourg','Norway','Japan','Switzerland','United States','Qatar','Iceland','Sweden','Singapore','Denmark'])

#Pass ndarray as an argument
s_country = pd.Series(np_country)
print(s_country)

0       Luxembourg
1           Norway
2            Japan
3      Switzerland
4    United States
5            Qatar
6          Iceland
7           Sweden
8        Singapore
9          Denmark
dtype: object

##### Creating Series from Scalar

In [3]:
#Print Series with Scalar input
Scalar_Series = pd.Series(5,index=['a','b','c','d','e','f'])
Scalar_Series

a    5
b    5
c    5
d    5
e    5
f    5
dtype: int64

In [4]:
Scalar_Series['a']

5

##### Creating Series from dict
A series can also be created with dict data input for faster operations.

In [5]:
#Evaluate Countries and their respective GDP per capita and print them as series
#Countries have been passed as an index and GDP as the actual data value
dict_countries_gdp = pd.Series([52000,40000,10000,60000,45000,35000,60000,48000,54000,77000],index=['Luxembourg','Norway','Japan','Switzerland','United States','Qatar','Iceland','Sweden','Singapore','Denmark'])
print(dict_countries_gdp)

Luxembourg       52000
Norway           40000
Japan            10000
Switzerland      60000
United States    45000
Qatar            35000
Iceland          60000
Sweden           48000
Singapore        54000
Denmark          77000
dtype: int64

In [6]:
dict_countries_gdp['Sweden']

48000

##### Accessing Elements in Series
Data can be accessed through different functions like loc, iloc by passing data element position or index range.

In [7]:
#access element in series
dict_countries_gdp[0]

52000

In [8]:
#access first 5 element in Series
dict_countries_gdp[0:5]

Luxembourg       52000
Norway           40000
Japan            10000
Switzerland      60000
United States    45000
dtype: int64

###### .loc  
look up by name or index

In [9]:
#look up a Country by name or index
dict_countries_gdp.loc['Sweden']

48000

###### .iloc 
look up by Position

In [10]:
#dict_countries_gdp.iloc[5]

##### Vectorizing Operations in Series
Vectorized operations are performed by the data element’s position.

In [11]:
#Add the series
first_vector_series = pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series = pd.Series([10,20,30,40],index=['a','b','c','d'])

first_vector_series + second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [12]:
#Changing the index in second_vector_series to check the changes in Addition output
second_vector_series = pd.Series([10,20,30,40],index=['a','d','b','c'])
first_vector_series + second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [13]:
#now replaces few indexes with new ones in second_vector_series
second_vector_series = pd.Series([10,20,30,40],index=['a','b','e','f'])
first_vector_series + second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

#### DataFrames
DataFrameis a two-dimensional labeled data structure with columns of potentially different types.

__Data Types__

Data types of Data Inputs can be:
* Integer
* String
* Python Object
* Floating Point

__Data Input__
* ndarray
* dict
* list
* Series
* DataFrame

__DataFrame__
* using Data Inputs an 2D-labeled data structure with columns of potentially different types, which is called as DataFrame.

##### Creating DataFrame from Lists
Create a DataFrame from dict of equal length lists

In [14]:
import pandas as pd 

#last five olympics data: place, year and No. of Countries participated
olympics_data_list = {'HostCity':['London','Beiging','Athens','Sydney','Atlanta'],
                     'year':[2012,2004,2008,2000,1996],
                     'No. of Participating countries':[205,204,201,200,197]}

#Pass the list to the DataFrame
df_olympic_data = pd.DataFrame(olympics_data_list)
df_olympic_data

  HostCity  year  No. of Participating countries
0   London  2012                             205
1  Beiging  2004                             204
2   Athens  2008                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

##### Creating DataFrame from dict
This example shows you how to create a DataFrame from a series of dicts.

__Creating DataFrame from dict of dicts__

In [15]:
olympics_data_dict = {'London':{2012:205},'Beijing':{2008:204}}
df_olympics_data_dict = pd.DataFrame(olympics_data_dict)
df_olympics_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

##### Viewing DataFrame
You can view a DataFrame by referring to the column name or with the describe function.

In [16]:
#Select by City name
df_olympic_data.HostCity

0     London
1    Beiging
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [17]:
#use describe function to Display the content
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  year  No. of Participating countries
0   London  2012                             205
1  Beiging  2004                             204
2   Athens  2008                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

##### Creating DataFrame from dict of Series

In [18]:
olympics_series_participation = pd.Series([205,204,201,200,197],index=[2012,2004,2008,2000,1996])
olympics_series_country = pd.Series(['London','Beiging','Athens','Sydney','Atlanta'],index=[2012,2004,2008,2000,1996])

df_olympics_Series = pd.DataFrame({'No.of Participating Countries':olympics_series_participation,'Host cities':olympics_series_country})
df_olympics_Series

      No.of Participating Countries Host cities
2012                            205      London
2004                            204     Beiging
2008                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

##### Creating DataFrame from ndarray

In [19]:
import numpy as np

#Create a ndarraywith years
np_array = np.array([2012,2008,2004,2006])
#Create a dict with the ndarray
dict_ndarray = {'year':np_array}

#Pass this dict to a new DataFrame
df_ndarray =pd.DataFrame(dict_ndarray)
df_ndarray

   year
0  2012
1  2008
2  2004
3  2006

##### Creating DataFrame from DataFrame Object

In [20]:
#Create a DataFrame from a DataFrame object
df_from_df = pd.DataFrame(df_olympics_Series)
df_from_df

      No.of Participating Countries Host cities
2012                            205      London
2004                            204     Beiging
2008                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

##### View and Select Data
__Problem Statement__: Demonstrate how to view and select data in a DataFrame

In [21]:
#import Libraries
import numpy as np
import pandas as pd

#Select DataFrame from Dict of Series for Summer Olympics : 1996 to 2012
olympics_series_country = pd.Series(['London','Beijing','Athens','sydney','Atlanta'], index=[2012,2008,2004,2000,1996])
olympics_Series_participation = pd.Series([205,204,201,200,197], index=[2012,2008,2004,2000,1996])

df_olympics_series=pd.DataFrame({'Host Cities':olympics_series_country,'No of Participating Countries':olympics_Series_participation})

#Display Content of Dataset
df_olympics_series

     Host Cities  No of Participating Countries
2012      London                            205
2008     Beijing                            204
2004      Athens                            201
2000      sydney                            200
1996     Atlanta                            197

###### View Data

In [22]:
#View Dataframe using Describe
df_olympics_series.describe

<bound method NDFrame.describe of      Host Cities  No of Participating Countries
2012      London                            205
2008     Beijing                            204
2004      Athens                            201
2000      sydney                            200
1996     Atlanta                            197>

In [23]:
#view top 2 records
df_olympics_series.head(2)

     Host Cities  No of Participating Countries
2012      London                            205
2008     Beijing                            204

In [24]:
#View last 3 Records
df_olympics_series.tail(3)

     Host Cities  No of Participating Countries
2004      Athens                            201
2000      sydney                            200
1996     Atlanta                            197

In [25]:
#View indexes of Dataset
df_olympics_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [26]:
#View Columns of Dataset
df_olympics_series.columns

Index(['Host Cities', 'No of Participating Countries'], dtype='object')

###### Select Data

In [27]:
#another data selection No of Participating Countries
df_olympics_series['No of Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No of Participating Countries, dtype: int64

In [28]:
#Select Data for Host Cities
df_olympics_series['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [29]:
#select label location based acess by label
df_olympics_series.loc[2012]

Host Cities                      London
No of Participating Countries       205
Name: 2012, dtype: object

In [30]:
#Integer-Location based indexing by Position
df_olympics_series.iloc[1:3]

     Host Cities  No of Participating Countries
2008     Beijing                            204
2004      Athens                            201

In [31]:
#Integer-Location based selection by index value
df_olympics_series.iat[0,1]

205

In [32]:
#Integer-Location based selection by index value
df_olympics_series.iat[0,0]

'London'

In [33]:
#select data element by condition where no. of participated countries are more than 200
#hint - use boolean expressinon
df_olympics_series[df_olympics_series['No of Participating Countries']>200]

     Host Cities  No of Participating Countries
2012      London                            205
2008     Beijing                            204
2004      Athens                            201

#### Missing Values
Missing values in a dataset are one of the most are one of the common challenges a data scientist come across.
Various factors may lead to missing data values, some of the common factors are
* Data not provided by the source
* Software issue
* Data integration issue
* Network issue

##### Handling Missing Values
It’s difficult to operate a dataset when it has missing values or uncommon indices.

In [34]:
import pandas as pd

#Add the series
first_vector_series = pd.Series([1,2,3,4],index=['a','b','c','d'])
second_vector_series = pd.Series([10,20,30,40],index=['d','c','g','h'])
sum_of_Series = first_vector_series + second_vector_series
sum_of_Series

a     NaN
b     NaN
c    23.0
d    14.0
g     NaN
h     NaN
dtype: float64

##### Handling Missing Values with Functions  - dropna()
The dropna() function drops all the values with uncommon indices.

In [35]:
sum_of_Series

a     NaN
b     NaN
c    23.0
d    14.0
g     NaN
h     NaN
dtype: float64

In [36]:
#dropna - drop NaN(Not a Number) values from dataset
dropna_s=sum_of_Series.dropna()
dropna_s

c    23.0
d    14.0
dtype: float64

##### Handling Missing Values with Functions - fillna()
The fillna() function fills all the uncommon indices with a number instead of dropping them.

In [37]:
#Fill the missing values with zero
#dropna_s does not have NaN values
dropna_s.fillna(0)

c    23.0
d    14.0
dtype: float64

In [38]:
#Fillna(0) - fill NaN(Not a Number) values with zero
fillna_s = sum_of_Series.fillna(0)
fillna_s

a     0.0
b     0.0
c    23.0
d    14.0
g     0.0
h     0.0
dtype: float64

##### Handling Missing Values with Functions:

for X+Y, X.add(Y,fill_value=n)

In [39]:
#fill the values with 0 before performing the addition operation for missing indices
fill_NaN_with_zero_before_sum = first_vector_series.add(second_vector_series,fill_value=0)
fill_NaN_with_zero_before_sum

a     1.0
b     2.0
c    23.0
d    14.0
g    30.0
h    40.0
dtype: float64

#### Data Operation
Data operation can be performed through various built-in methods for faster data processing.

In [40]:
import pandas as pd
#Declare movie rating dataframe: rating from 1 to 5 (star * rating)
df_movie_rating = pd.DataFrame({'moive1':[5,4,3,3,2,1],
                              'movie2':[4,5,2,3,4,2]},
                              index=['tom','jeff','peter','ram','ted','paul'])
df_movie_rating

       moive1  movie2
tom         5       4
jeff        4       5
peter       3       2
ram         3       3
ted         2       4
paul        1       2

##### Data Operation with Functions
While performing data operation, custom functions can be applied using the applymap method.

In [41]:
#Declare a custom function
def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 4:
        return 'B'
    if rating == 3:
        return 'C'
    else:
        return 'F'

#Test the function
print(movie_grade(5))

A

In [42]:
#Apply the function to the DataFrame
df_movie_rating.applymap(movie_grade)

      moive1 movie2
tom        A      B
jeff       B      A
peter      C      F
ram        C      C
ted        F      B
paul       F      F

##### Data Operation with Statistical Functions

In [43]:
#Create a DataFrame with two test
df_test_scores = pd.DataFrame({'test1':[95,84,73,88,82,61],
                              'test2':[74,85,82,73,77,79]},
                              index=['jack','lewis','patrick','rich','kelly','paula'])
df_test_scores

         test1  test2
jack        95     74
lewis       84     85
patrick     73     82
rich        88     73
kelly       82     77
paula       61     79

__Apply the max function to find the maximum score__

In [44]:
df_test_scores.max()

test1    95
test2    85
dtype: int64

__Apply the mean function to find the average score__

In [45]:
df_test_scores.mean()

test1    80.500000
test2    78.333333
dtype: float64

__Apply the std function to find the standard deviation for both the tests__

In [46]:
df_test_scores.std()

test1    11.979149
test2     4.633213
dtype: float64

##### Data Operation Using Groupby

In [47]:
#Create a DataFrame with first and last name as former presidents
df_president_name = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],
                                 'last':['Bush','clinton','Regan','Carter','Washington']})
df_president_name

    first        last
0  George        Bush
1    Bill     clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [48]:
#Group the DataFrame with the first name
grouped = df_president_name.groupby('first')

In [49]:
grp_data = grouped.get_group('George')
grp_data

    first        last
0  George        Bush
4  George  Washington

##### Data Operation Using Sorting

In [50]:
#Sort values by first name
df_president_name.sort_values('first')

    first        last
1    Bill     clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

##### Data Operations - Example
__Problem Statement:__ 

Demonstrate how to perform data operations such as merge, find duplicates & concatenate the datasets

__Merge Dataframes__

In [51]:
import pandas as pd

#define the studebt dataFrame with Math Data
df_student_math = pd.DataFrame({'student':['Tom','jack','Don','Ram','jeff','David'],'ID':[10,56,31,85,9,22]})
#define the studebt dataFrame with Math Data
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'],'ID':[10,12,22]})

#merge both dataFrame to form a single dataframe with math and Science data
pd.merge(df_student_math,df_student_science)

  student  ID
0     Tom  10
1   David  22

__#Merge with key on student__

In [52]:
#Merge with key on student
pd.merge(df_student_math,df_student_science,on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

__Merge left join on key ID and also fill NaN values with 'x'__

In [53]:
#Merge left join on key ID and also fill NaN values with 'x'
pd.merge(df_student_math,df_student_science,on='student',how='left').fillna('x')

  student  ID_x  ID_y
0     Tom    10  10.0
1    jack    56     x
2     Don    31     x
3     Ram    85  12.0
4    jeff     9     x
5   David    22  22.0

__Concatenate Dataframe__

In [54]:
#Concatenate Dataframe
pd.concat([df_student_math,df_student_science],ignore_index=True)

  student  ID
0     Tom  10
1    jack  56
2     Don  31
3     Ram  85
4    jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [55]:
#Define new dataframe with student survey data
df_student_survey_data = pd.DataFrame({'student':['Tom','jack','Tom','Ram','jeff','jack'],'ID':[10,56,10,85,9,22]})
df_student_survey_data

  student  ID
0     Tom  10
1    jack  56
2     Tom  10
3     Ram  85
4    jeff   9
5    jack  22

__check for the duplicate values__

In [56]:
#check for the duplicate values
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

__drop duplicate values with students as key__

In [57]:
#drop duplicate values with students as key
df_student_survey_data.drop_duplicates('student')

  student  ID
0     Tom  10
1    jack  56
3     Ram  85
4    jeff   9

__drop duplicate values with ID as key__

In [58]:
#drop duplicate values with ID as key
df_student_survey_data.drop_duplicates('ID')

  student  ID
0     Tom  10
1    jack  56
3     Ram  85
4    jeff   9
5    jack  22

#### Data Standardization
As a DataScientist there can be several instances where we will observe unusual data values such as outliers. Such numbers may be spread in an abnormal distance than the mean value.

__Standardization__ is one of the most common ways that enables us to analyze the dataset and catch the outliers.

In [59]:
#Create a function to return the standardize value
def standardize_tests(test):
    return (test-test.mean())/test.std()
standardize_tests(df_test_scores['test1'])

jack       1.210437
lewis      0.292174
patrick   -0.626088
rich       0.626088
kelly      0.125218
paula     -1.627829
Name: test1, dtype: float64

In [60]:
#Apply the function to the entire dataset
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)
standardize_test_scores(df_test_scores)
#Standardized test data is applied for the entire DataFrame

            test1     test2
jack     1.210437 -0.935276
lewis    0.292174  1.438886
patrick -0.626088  0.791387
rich     0.626088 -1.151109
kelly    0.125218 -0.287777
paula   -1.627829  0.143889

The major Distinction between __.apply()__ and __.applymap()__ methods is that
* __.apply()__: returns series or dataframe
* __.applymap()__: returns only dataframe. (refer 8.1)

#### File Read and Write Support
Pandas Support multiple files for data analysis, which can be read and written with the help of methods like 
* "read_fileextension" - indicates ability to read a file type
* "to_fileextension" - indicates ability to write a file type

Some of the files are
* excel
    * read_excel
    * to_excel
* hdf
    * read_hdf
    * to_hdf 
* clipboard
    * read_clipboard
    * to_clipboard
* html
    * read_html
    * to_html
* pickle
    * read_pickle
    * to_pickle
* DTA
    * read_stata
    * to_stata
* SAS
    * read_sas
    * to_sas
* SQL
    * read_sql
    * to_sql
* json
    * read_json
    * to_json
* CSV
    * read_csv
    * to_csv

#### Pandas SQL Operation
SQL operations using Pandas and in-memory database SQLite3

In [61]:
#import pandas library
import pandas as pd
#import Sqlite3
import sqlite3

#create SQL table
create_table = """CREATE TABLE student_score
(Id INTEGER, Name VARCHAR(20), Math REAL,
Science REAL
);"""

#execute the SQL statement
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(create_table)
executeSQL.commit()

#prepare a SQL query
SQL_query = executeSQL.execute('select * from student_score')

#fetch result from SQLlite database
resulset = SQL_query.fetchall()

#view result(empty data)
resulset

[]

In [62]:
#prepare records to be inserted into SQL table through SQL statement
insertSQL = [(10,'Jack',85,92),
            (29,'Tom',73,89),
            (65,'Ram',65.6,77),
            (5,'Steve',55,91)]

#insert records into SQL table through SQL statement
insert_statement = "Insert into student_score values(?,?,?,?)"
executeSQL.executemany(insert_statement,insertSQL)
executeSQL.commit()

#prepare SQL query
SQL_query = executeSQL.execute("select * from student_score")

#fetch the resultset for the query
resulset = SQL_query.fetchall()

#view the resultset
resulset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.6, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [63]:
#put the records together in dataframe
df_student_records = pd.DataFrame(resulset,columns=list(zip(*SQL_query.description))[0])

#view the records in pandas dataframe
df_student_records

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.6     77.0
3   5  Steve  55.0     91.0